       IDENTIFICATION DIVISION. 
       PROGRAM-ID. COMBINED AS "COMBINED".
       
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

       SELECT DATAFILE ASSIGN TO "DATAFILE.DAT"
	      ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD DATAFILE.
       01 INPUTTED-DATA.
	      88 ENDOFFILE VALUE HIGH-VALUES.
          05 FULL-NAME.
             10 FIRST-NAME PIC X(15).
             10 LAST-NAME PIC X(15).
          05 BIRTHDAY.
             10 BIRTH-YEAR PIC 9(4).
             10 BIRTH-DAY PIC 9(2).
             10 BIRTH-MONTH PIC 9(2).
       WORKING-STORAGE SECTION. 
       01 WS-FULL-NAME.
            05 WS-FIRST-NAME PIC X(15).
            05 FILLER PIC X(2).
            05 WS-LAST-NAME PIC X(15).
       01 WS-FILE-STRUCTURE.
          05 HEADERS.
            10 FILLER PIC X(3) VALUE SPACES.
            10 FILLER PIC X(10) VALUE "FIRST NAME".
            10 FILLER PIC X(5) VALUE SPACES.
            10 FILLER PIC X(10) VALUE "LAST NAME".
            10 FILLER PIC X(5) VALUE SPACES.
            10 FILLER PIC X(10) VALUE "BIRTHDAY".

       PROCEDURE DIVISION.

       0100-READ-FILE.
           OPEN INPUT DATAFILE.
           READ DATAFILE
           AT END SET ENDOFFILE TO TRUE
           END-READ
           DISPLAY HEADERS.


           PERFORM 0200-DISPLAY-DATA UNTIL ENDOFFILE.

       0200-DISPLAY-DATA.
           PERFORM UNTIL ENDOFFILE
               MOVE FIRST-NAME TO WS-FIRST-NAME
               MOVE LAST-NAME TO WS-LAST-NAME
               DISPLAY WS-FULL-NAME
               READ DATAFILE
               AT END SET ENDOFFILE TO TRUE
               END-READ
           END-PERFORM.
       END PROGRAM COMBINED.
