       IDENTIFICATION DIVISION. 
       PROGRAM-ID. COMBINED AS "COMBINED".
       
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

       SELECT DATAFILE ASSIGN TO "DATAFILE.DAT"
	      ORGANIZATION IS LINE SEQUENTIAL.
      * DATAFILE REFERS TO LOADED DATA

       DATA DIVISION.
       FILE SECTION.
       FD DATAFILE. 
      * THIS DATA IS FROM THE FILE
       01 INPUTTED-DATA.
	      88 ENDOFFILE VALUE HIGH-VALUES.
          05 FULL-NAME.
             10 FIRST-NAME PIC X(15).
             10 LAST-NAME PIC X(15).
          05 BIRTHDAY.
             10 BIRTH-YEAR PIC 9(4).
             10 BIRTH-DAY PIC 9(2).
             10 BIRTH-MONTH PIC 9(2).
       WORKING-STORAGE SECTION. 
       01 WS-DATA.
      * ALL LOCAL VARIABLES THAT WILL STORE THE DATA FROM FILE
           05 WS-FULL-NAME.
               10 WS-FIRST-NAME PIC X(15).
               10 FILLER PIC X(1) VALUE SPACES.
               10 WS-LAST-NAME PIC X(15).
           05 WS-BIRTHDAY.
               10 WS-BIRTH-DAY PIC 9(2).
               10 FILLER PIC X(1) VALUE SPACES.
               10 WS-BIRTH-MONTH PIC 9(2).
               10 FILLER PIC X(1) VALUE SPACES.
               10 WS-BIRTH-YEAR PIC 9(4).
        01 HEADERS. 
      * FORMATTING FOR THE HEADERS, SPACES LEFT TO SPACE THEM OUT
           05 FILLER PIC X(10) VALUE "FIRST NAME".
           05 FILLER PIC X(5) VALUE SPACES.
           05 FILLER PIC X(10) VALUE "LAST NAME".
           05 FILLER PIC X(5) VALUE SPACES.
           05 FILLER PIC X(20) VALUE "BIRTHDAY (D/M/Y)".

       PROCEDURE DIVISION.

       0100-READ-FILE.
      * OPENS THE FILES AND DISPLAYS THE HEADER
           OPEN INPUT DATAFILE.
           READ DATAFILE
           AT END SET ENDOFFILE TO TRUE
           END-READ
           DISPLAY HEADERS.

      * GOES TO 0200-DISPLAY-DATA UNTIL ENDOFFILE IS TRUE, SET THE FALSE
      * BY DEFAULT
           PERFORM 0200-DISPLAY-DATA UNTIL ENDOFFILE.

       0200-DISPLAY-DATA.
           PERFORM UNTIL ENDOFFILE
      * FOR EACH ENTRY IN THE FILE, 0200 IS LOOPED THROUGH, SAVING EACH
      * VALUE IN THE FILE TO A LOCAL VARIABLE. DATA IS THEN DISPLAYED 
      * AND FILE 
               MOVE FIRST-NAME TO WS-FIRST-NAME
               MOVE LAST-NAME TO WS-LAST-NAME
               MOVE BIRTH-DAY TO WS-BIRTH-DAY
               MOVE BIRTH-MONTH TO WS-BIRTH-MONTH
               MOVE BIRTH-YEAR TO WS-BIRTH-YEAR
               DISPLAY WS-DATA
               READ DATAFILE
               AT END SET ENDOFFILE TO TRUE
               WRITE INPUTTED-DATA FROM INPUTTED-DATA
               END-WRITE
               END-READ
           END-PERFORM.
       END PROGRAM COMBINED.
